<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Express Scribe disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.ExpressScribe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ExpressScribe</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.foigus.download.ExpressScribe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/unarchive/ExpressScribe_i.dmg</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/unarchive/ExpressScribe_i.dmg/ExpressScribe.app</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/ExpressScribe-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
