<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Prey and create an install package to /tmp/ to accomodate API enrollment.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.Prey</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Prey</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.Prey</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkg</string>
                <key>pkgdirs</key>
               <dict>
                    <key>private/tmp</key>
                    <string>1777</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg/private/tmp/Prey.pkg</string>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Prey.pkg</string>
            </dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>private</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>private/tmp</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>com.prey.agent</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
