<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of CEmu from GitHub and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.CEmu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CEmu</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.CEmu</string>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>