<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of CEmu from GitHub and builds a package. GITHUB_ARCHITECTURE can be either 'arm' or 'intel'.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.CEmu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CEmu</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.CEmu</string>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%GITHUB_ARCHITECTURE%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
