<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest DevSpace version from GitHub releases.
Set DEVSPACE_ARCH to x86_64 (Intel) or arm64 (Apple silicon).
Set DEVSPACE_DOWNLOAD to amd64 (Intel) or arm64 (Apple silicon).
    </string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.DevSpace</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DevSpace</string>
        <key>DEVSPACE_ARCH</key>
        <string>arm64</string>
        <key>DEVSPACE_DOWNLOAD</key>
        <string>arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>loft-sh/devspace</string>
                <key>asset_regex</key>
                <string>.*(darwin).%DEVSPACE_DOWNLOAD%*$</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>devspace-%DEVSPACE_DOWNLOAD%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
    </array>
</dict>
</plist>
