<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Vendini TicketAgent.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.VendiniTicketAgent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Vendini Ticket Agent</string>
        <key>SEARCH_URL</key>
        <string>https://apps.vendini.com/member/posdownload</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Vendini TicketAgent is no longer publicly downloadable. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href="(.*?.pkg)"</string>
                <key>result_output_var_name</key>
                <string>pkg_name</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%/%pkg_name%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Vendini, Inc. (AX97ZZ49WP)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
