<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Okta Verify. 
    
    OKTA_DOMAIN: Usually "okta.com"
    OKTA_ORG: Org tenant - "myorg" part of a subdomain like "myorg.okta.com"
    OKTA_RELEASE_CHANNEL: GA or EA
    </string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.OktaVerify</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OktaVerify</string>
        <key>OKTA_DOMAIN</key>
        <string>okta.com</string>
        <key>OKTA_ORG</key>
        <string></string>
        <key>OKTA_RELEASE_CHANNEL</key>
        <string>GA</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
                <key>url</key>
                <string>https://%OKTA_ORG%.%OKTA_DOMAIN%/api/v1/artifacts/OKTA_VERIFY_MACOS/download?releaseChannel=%OKTA_RELEASE_CHANNEL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Okta, Inc. (B7F62B65BN)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
