<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Enthought Canopy with Python 3.5</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.Canopy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Canopy</string>
        <key>DOWNLOAD_URL</key>
        <string>https://assets.enthought.com</string>
        <key>RE_PATTERN</key>
        <string>(?&lt;=\'macOS \[64-bit\]\', '3.5'\);\" href=\").*/(?=\".*)</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%RE_PATTERN%</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%/downloads</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
         <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>Canopy.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
