<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Cinc Auditor package. Use either x86_64 or arm64 for the ARCHITECTURE key.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.CincAuditor</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string>arm64</string>
        <key>NAME</key>
        <string>CincAuditor</string>
        <key>PRODUCT_VERSION</key>
        <string>11</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(?&lt;=stable\/)(.*)(?=.dmg)</string>
                <key>result_output_var_name</key>
                <string>url_fragment</string>
                <key>url</key>
                <string>https://omnitruck.cinc.sh/stable/cinc-auditor/metadata?v=latest&amp;p=mac_os_x&amp;pv=11&amp;m=%ARCHITECTURE%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>cinc-auditor-%ARCHITECTURE%.dmg</string>
                <key>url</key>
                <string>https://ftp.osuosl.org/pub/cinc/files/stable/%url_fragment%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
    </array>
</dict>
</plist>