<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of exacqVision Client.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.exacqVision</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>exacqVision</string>
        <key>SEARCH_URL</key>
        <string>https://www.exacq.com/support/downloads.php</string>
        <key>DOWNLOAD_URL</key>
        <string>https://exacq.com/public</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>/public/([0-9\.]+)</string>
                <key>result_output_var_name</key>
                <string>MAIN_VERSION</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>exacqVisionClient_([0-9\.]+)</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%/%MAIN_VERSION%/exacqVisionClient_%version%_x64.dmg</string>
                <key>filename</key>
                <string>exacqVisionClient_%version%_x64.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/edvrclient.app</string>
                <key>requirement</key>
                <string>identifier "com.exacq.edvrclient" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "77CC7E9EL3"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/ePlayerPro.app</string>
                <key>requirement</key>
                <string>identifier "com.exacq.ePlayerPro" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "77CC7E9EL3"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>