<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Bitnami MAMP Stack.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.BitnamiMAMP</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_URL</key>
        <string>https://bitnami.com</string>
        <key>NAME</key>
        <string>BitnamiMAMP</string>
        <key>RE_PATTERN</key>
        <string>href="(\/redirect\/to\/.*?.dmg)"</string>
    </dict>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%RE_PATTERN%</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%/stack/mamp/installer</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%/%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/MAMP.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "com.bitrock.appinstaller" and certificate leaf[subject.OU] = "49P7N62XPM"</string>
                </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
