<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of cdef from GitHub. Includes pre-releases.</string>
	<key>Identifier</key>
	<string>com.github.nstrauss.pkg.cdef</string>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.download.cdef</string>
	<key>Input</key>
	<dict/>
</dict>
</plist>
