<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Repackage the DMG installer Lightspeed provides because developers hate admins.
    The user must specify the path to the app at runtime via the `--key AGENT_DMG="/path/to/dmg"` option.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.RelaySmartAgent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RelaySmartAgent</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Arguments</key>
          <dict>
              <key>flat_pkg_path</key>
              <string>%AGENT_DMG%/SmartAgent.pkg</string>
              <key>destination_path</key>
              <string>%RECIPE_CACHE_DIR%/unpack</string>
          </dict>
          <key>Processor</key>
          <string>FlatPkgUnpacker</string>
      </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Setup.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>mobilefilter_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/usr/local/bin/mobilefilter</string>
            </dict>
            <key>Processor</key>
            <string>LightspeedRelaySmartAgentVersioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/usr/local/bin/SmartAgentJS.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/usr/local/bin</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/payload/usr/local/bin/SmartAgentJS.zip</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/usr/local/bin/SmartAgentJS</string>
                <key>source_path</key>
                <string>%AGENT_DMG%/.sajs/config.json</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>force_pkg_build</key>
                <string>True</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>id</key>
                    <string>com.lightspeedsystems.mobilefilter</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <key>scripts</key>
                    <string>scripts</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
