<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest release of the OpenWebStart installer from GitHub.

Acceptable values for ARCH include:
- aarch64 (Apple Silicon, default)
- x64 (Intel)
</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.OpenWebStart</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenWebStart</string>
        <key>ARCH</key>
        <string>aarch64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>OpenWebStart_macos-%ARCH%.+\.dmg$</string>
                <key>github_repo</key>
                <string>karakun/OpenWebStart</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>OpenWebStart-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/OpenWebStart Installer.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M975RKD6AX</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
