Description: Download the latest Homebrew package version from GitHub and import into Munki.
Identifier: com.github.nstrauss.munki.Homebrew
MinimumVersion: "2.3"
ParentRecipe: com.github.nstrauss.download.Homebrew

Input:
  NAME: Homebrew
  MUNKI_REPO_SUBDIR: apps/Homebrew
  pkginfo:
    catalogs:
      - testing
    description: The missing package manager for macOS.
    developer: Homebrew
    display_name: "%NAME%"
    name: "%NAME%"
    unattended_install: true
    unattended_uninstall: true
    uninstall_method: uninstall_script
    uninstall_script: |
      #!/bin/bash

      NONINTERACTIVE=1 /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/uninstall.sh)"

Process:
  - Processor: MunkiPkginfoMerger
    Arguments:
      additional_pkginfo: 
        installcheck_script: |
          #!/bin/zsh

          installed=1
          not_installed=0
          target_version="%version%"

          # Get the current user
          current_user="$(/usr/bin/stat -f%Su /dev/console)"

          # If we're at the login window, Homebrew's .pkg will fail to install
          if [[ $current_user == "root" || $current_user == "_mbsetupuser" || $current_user == "loginwindow" ]]; then
            /bin/echo "No user account is logged in, so considering \"installed\" for now."
            exit "$installed"
          fi

          if [[ $(uname -m) == "x86_64" ]]; then
            brew="/usr/local/Homebrew/bin/brew"
          else
            brew="/opt/homebrew/bin/brew"
          fi

          if [[ ! -f "$brew" ]]; then
            /bin/echo "$brew doesn't exist."
            exit "$not_installed"
          fi

          current_version=$(/usr/bin/su -l $current_user -c "$brew --version" | /usr/bin/head -n 1 | /usr/bin/awk '{ print $2 }')

          if [[ "$current_version" == "$target_version" ]]; then
            /bin/echo "$target_version is installed."
            exit "$installed"
          else
            /bin/echo "$current_version isn't $target_version."
            exit "$not_installed"
          fi

  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
