<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Afinia Studio.</string>
    <key>Identifier</key>
    <string>com.github.jkosowsk.download.afiniastudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AfiniaStudio</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.afinia.com/afinia-downloads/studio/AfiniaStudio_Mac.zip</string>
                <key>filename</key>
                <string>AfiniaStudio.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>