<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Bean Loader and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.BeanLoader</string>
    <key>Input</key>
    <dict>
        <key>BUNDLE_ID</key>
        <string>com.punchthrough.LightBlue-Bean.Bean-Loader</string>
        <key>NAME</key>
        <string>Bean Loader</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.BeanLoader</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Bean Loader has been discontinued. This recipe will eventually be removed. https://punchthrough.com/bean/</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>