<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string>Download a GitHub release using GitHubReleasesInfoProvider and install. Only supports .pkg. This is a generic template recipe intended to be used with an override.</string>
	<key>Identifier</key>
    <string>com.github.nstrauss.install.Generic-GitHubReleasesInfoProvider</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.Generic-GitHubReleasesInfoProvider</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>
