<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of kubectl.

Use the KUBECTL_ARCH input variable to specify whether you want to download the
Intel (amd64) or Apple silicon (arm64) version.
    </string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.kubectl</string>
    <key>Input</key>
    <dict>
        <key>KUBECTL_ARCH</key>
        <string>arm64</string>
        <key>NAME</key>
        <string>kubectl</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>v(\S+)</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://dl.k8s.io/release/stable.txt</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://dl.k8s.io/release/v%version%/bin/darwin/%KUBECTL_ARCH%/kubectl</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
