<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DRC INSIGHT (WIDA).</string>
	<key>Identifier</key>
	<string>com.github.nstrauss.download.DRC_INSIGHT</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DRC_INSIGHT</string>
		<key>DOWNLOAD_URL</key>
		<string>https://wida-insight-client.drcedirect.com/contentservices/download/securebrowser/drc_insight_setup.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Data Recognition Corporation (5YNGWT65GB)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
        	</dict>
        </dict>
	</array>
</dict>
</plist>
