<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Restor from GitHub. Includes pre-releases.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.Restor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Restor</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>google/restor</string>
                <key>include_prereleases</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Restor.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
