<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of College Board's 2021 Digital AP Exams app and create a package.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.2021DigitalAPExams</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>2021DigitalAPExams</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.2021DigitalAPExams</string>
    <key>MiniumumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/2021 Digital AP Exams.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/2021DigitalAPExams-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
