<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download and install the latest Respondus LockDown Browser lab version.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.install.RespondusLockDownBrowserLab</string>
    <key>Input</key>
    <dict>
        <key>LAB_HASH</key>
        <string>FILLINYOURLABHASH</string>
        <key>NAME</key>
        <string>LockDownBrowserLab</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.RespondusLockDownBrowser</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>LAB_HASH == "FILLINYOURLABHASH"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Install Respondus LockDown Browser (x64c) %INSTITUTION_ID%{%LAB_HASH%}.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileMover</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>
