<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest LockDown Browser student version. Be sure to change the institution ID to be your institution's ID.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.RespondusLockDownBrowser</string>
    <key>Input</key>
    <dict>
        <key>INSTITUTION_ID</key>
        <string>FILLINYOURINSTITUTIONID</string>
        <key>NAME</key>
        <string>LockDownBrowser</string>
        <key>SEARCH_URL</key>
        <string>https://www.respondus.com/lockdown/download.php?id=%INSTITUTION_ID%</string>
        <key>SEARCH_DOWNLOAD_URL</key>
        <string>https://download.respondus.com/lockdown/download7.php?id=%INSTITUTION_ID%</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>INSTITUTION_ID == "FILLINYOURINSTITUTIONID"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(\&lt;br&gt;Version: (?P&lt;version&gt;.*?)\&lt;br&gt;)</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                 </dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>&lt;a href=&quot;(?P&lt;download_url&gt;https:\/\/.*\.zip)&quot;&gt;</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                 </dict>
                <key>url</key>
                <string>%SEARCH_DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%download_url%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Install*.*pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Respondus (8CA6NAN723)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
