<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages NoMADADLoginAD.bundle which exists locally in /Library/Security/SecurityAgentPlugins</string>
	<key>Identifier</key>
	<string>com.nstrauss.github.pkg.NoMADLoginAD</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NoMADLoginAD</string>
        <key>BUNDLE_DIR</key>
        <string>/Library/Security/SecurityAgentPlugins</string>
        <key>MECHANISMS_DIR</key>
		<string>%RECIPE_DIR%/evaluate-mechanisms</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.0.0</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%BUNDLE_DIR%/NoMADLoginAD.bundle/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0775</string>
                    <key>Library/Security</key>
                    <string>0755</string>
                    <key>Library/Security/SecurityAgentPlugins</key>
                    <string>0755</string>
                    <key>private</key>
                    <string>0755</string>
                    <key>private/tmp</key>
                    <string>1777</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%BUNDLE_DIR%/NoMADLoginAD.bundle</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/Security/SecurityAgentPlugins/NoMADLoginAD.bundle</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%MECHANISMS_DIR%</string>
                <key>destination_path</key>
                <string>%pkgroot%/private/tmp/evaluate-mechanisms</string>
            </dict>
        </dict>		
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>menu.nomad.NoMADLoginAD</string>
                    <key>scripts</key>
                    <string>scripts</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>private</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>