<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TestNav and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.pkg.TestNav</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TestNav</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.TestNav</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/TestNav.app</string>
                <key>source_path</key>
                <string>%pathname%/TestNav.app</string>
            </dict>
             <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%destination_path%</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%destination_path%</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
