<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TestNav.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.TestNav</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TestNav</string>
        <key>SEARCH_URL</key>
        <string>https://download.testnav.com/installerVersions.json</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>json_url</key>
                <string>%SEARCH_URL%</string>
                <key>json_key</key>
                <string>mac</string>
            </dict>
            <key>Processor</key>
            <string>SimpleJSONParser</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.testnav.com/_testnavinstallers/%json_value%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/TestNav.app</string>
                <key>requirement</key>
                <string>identifier "com.pearson.testnav.desktopapp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9EGT93JZWD"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
