<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTDPLIST1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and imports the latest swiftDialog version to Munki.</string>
        <key>Identifier</key>
        <string>com.github.nstrauss.munki.swiftDialog</string>
        <key>ParentRecipe</key>
        <string>com.github.zentralpro.download.swiftDialog</string>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_NAME</key>
            <string>swiftDialog</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/swiftDialog</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>DISPLAY_NAME</key>
            <string>swiftDialog</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>swiftDialog is an open source admin utility app written in SwiftUI that displays dialog windows.</string>
                <key>developer</key>
                <string>Bart Reardon</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%MUNKI_NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/tmp-package.pkg/Payload</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>derive_minimum_os_version</key>
                    <string>true</string>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/payload/</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Library/Application Support/Dialog/Dialog.app</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>