<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of 1Password and imports into a Munki repo.

Use either x86_64 or arm64 for ARCHITECTURE key.
    </string>
    <key>Identifier</key>
    <string>com.github.nstrauss.munki.1Password</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string>x86_64</string>
        <key>MUNKI_CATEGORY</key>
        <string>Security</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/1Password</string>
        <key>NAME</key>
        <string>1Password</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>1Password</string>
                <string>1Password 7</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>1Password is a password manager that goes beyond simple password storage by integrating directly with your web browser to automatically log you into websites, enter credit card information, fill registration forms, and easily generate strong passwords.</string>
            <key>developer</key>
            <string>AgileBits Inc.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>supported_architectures</key>
            <array>
                <string>%ARCHITECTURE%</string>
            </array>
            <key>preinstall_script</key>
            <string>#!/bin/bash

user_id="$(scutil &lt;&lt;&lt; 'show State:/Users/ConsoleUser' | awk '($1 == "Name" &amp;&amp; $NF == "loginwindow") { exit } ($1 == "UID") { print $NF; exit }')"

old_apps=(
    "/Applications/1Password 6.app"
    "/Applications/1Password 7.app"
    "/Applications/1Password.app"
)

for i in "${old_apps[@]}"; do
    if [[ -d "$i" ]]; then
        /bin/rm -rf "$i"
    fi
done

old_launchd=(
    "2BUA8C4S2C.com.agilebits.onepassword7-helper"
    "com.agilebits.onepassword7-launcher"
)

if [[ ! -z "$user_id" ]]; then
    for l in "${old_launchd[@]}"; do
        /bin/launchctl asuser 501 /bin/launchctl stop "$l"
        /bin/launchctl asuser 501 /bin/launchctl remove "$l"
    done
fi

/usr/bin/killall "1Password 7"

exit 0
            </string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.1Password</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
