<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Dremel DigiLab 3D Slicer.</string>
    <key>Identifier</key>
    <string>com.github.nstrauss.download.DremelDigiLab3DSlicer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Dremel DigiLab 3D Slicer</string>
        <key>SEARCH_URL</key>
        <string>https://digilab.dremel.com/3D-software</string>        
        <key>DOWNLOAD_URL</key>
        <string>https://digilab.dremel.com/files/3Dslicer</string>        
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>([0-9\.]+)-mac</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>%SEARCH_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%/Dremel3DSlicer-%version%-mac.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/app</string>
                <key>purge_destination</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/app/Dremel DigiLab 3D Slicer.app</string>
                <key>requirement</key>
                <string>identifier "com.eht3.slicer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JRH3BDU5ZX</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
